sc750/nuttx/arch/risc-v/src/esp32p4/espressif/esp_i2s.c
/****************************************************************************
 * arch/risc-v/src/esp32p4/espressif/esp_i2s.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include <nuttx/kmalloc.h>
#include <nuttx/mutex.h>

#include <assert.h>
#include <debug.h>
#include <errno.h>
#include <stdbool.h>
#include <stdint.h>
#include <math.h>

#include <nuttx/nuttx.h>
#include <nuttx/irq.h>
#include <nuttx/arch.h>
#include <nuttx/spinlock.h>

#include "riscv_internal.h"

#include "esp_gpio.h"
#include "esp_irq.h"

#include "esp_i2s.h"

#include "hal/i2s_hal.h"
#include "hal/i2s_ll.h"
#include "hal/i2s_periph.h"
#include "soc/i2s_reg.h"
#include "hal/i2s_types.h"
#include "soc/gpio_sig_map.h"
#include "periph_ctrl.h"

#include "esp_attr.h"
#include "esp_cache.h"
#include "esp_check.h"
#include "esp_clk_tree.h"
#include "esp_bit_defs.h"
#include "esp_cpu.h"
#include "esp_rom_sys.h"
#include "riscv/interrupt.h"
#include "soc/lldesc.h"
#include "hal/dma_types.h"
#if SOC_I2S_SUPPORTS_APLL
#  include "hal/clk_tree_ll.h"
#  include "clk_ctrl_os.h"
#endif
#include "hal/gdma_periph.h"
#include "hal/gdma_ll.h"

#if SOC_CACHE_INTERNAL_MEM_VIA_L1CACHE
#  include "hal/cache_hal.h"
#  include "hal/cache_ll.h"
#endif

#if SOC_GDMA_SUPPORTED
#  include "esp_private/gdma.h"
#endif

#ifdef CONFIG_PM
#  include "soc/soc_caps.h"
#  include "include/esp_pm.h"
#endif

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#ifdef CONFIG_ESPRESSIF_I2S0_DATA_BIT_WIDTH_8BIT
#  define ESPRESSIF_I2S0_DATA_BIT_WIDTH 8
#elif CONFIG_ESPRESSIF_I2S0_DATA_BIT_WIDTH_16BIT
#  define ESPRESSIF_I2S0_DATA_BIT_WIDTH 16
#elif CONFIG_ESPRESSIF_I2S0_DATA_BIT_WIDTH_24BIT
#  define ESPRESSIF_I2S0_DATA_BIT_WIDTH 24
#elif CONFIG_ESPRESSIF_I2S0_DATA_BIT_WIDTH_32BIT
#  define ESPRESSIF_I2S0_DATA_BIT_WIDTH 32
#endif

/* I2S DMA RX/TX description number */

#define I2S_DMADESC_NUM                 (CONFIG_I2S_DMADESC_NUM)

/* I2S DMA channel number */

#define I2S_DMA_CHANNEL_MAX (2)

#ifdef CONFIG_ESPRESSIF_I2S0_TX
#  define I2S0_TX_ENABLED 1
#else
#  define I2S0_TX_ENABLED 0
#endif

#ifdef CONFIG_ESPRESSIF_I2S0_RX
#  define I2S0_RX_ENABLED 1
#else
#  define I2S0_RX_ENABLED 0
#endif

/* Debug ********************************************************************/

#ifdef CONFIG_DEBUG_I2S_INFO
#  define CONFIG_ESPRESSIF_I2S_DUMPBUFFERS
#else
#  undef CONFIG_ESPRESSIF_I2S_DUMPBUFFERS
#endif

#define I2S_GPIO_UNUSED -1      /* For signals which are not used */

#define I2S_TDM_AUTO_SLOT_NUM    (0)
#define I2S_TDM_AUTO_WS_WIDTH    (0)
#define I2S_TDM_AUTO_SLOT        (I2S_TDM_SLOT0 | I2S_TDM_SLOT1)

#define I2S_TDM_PHILIPS_SLOT_DEFAULT_CONFIG(cfg, bits_per_sample, mask) \
    cfg.slot_mask = (mask),                                             \
    cfg.ws_width = I2S_TDM_AUTO_WS_WIDTH,                               \
    cfg.ws_pol = false,                                                 \
    cfg.bit_shift = true,                                               \
    cfg.left_align = false,                                             \
    cfg.big_endian = false,                                             \
    cfg.bit_order_lsb = false,                                          \
    cfg.skip_mask = false                                               \

#define I2S_TDM_MSB_SLOT_DEFAULT_CONFIG(cfg, bits_per_sample, mask) \
    cfg.slot_mask = (mask),                                         \
    cfg.ws_width = I2S_TDM_AUTO_WS_WIDTH,                           \
    cfg.ws_pol = false,                                             \
    cfg.bit_shift = false,                                          \
    cfg.left_align = false,                                         \
    cfg.big_endian = false,                                         \
    cfg.bit_order_lsb = false,                                      \
    cfg.skip_mask = false                                           \

#define I2S_TDM_PCM_SHORT_SLOT_DEFAULT_CONFIG(cfg, bits_per_sample, mask) \
    cfg.slot_mask = (mask),                                               \
    cfg.ws_width = 1,                                                     \
    cfg.ws_pol = true,                                                    \
    cfg.bit_shift = true,                                                 \
    cfg.left_align = false,                                               \
    cfg.big_endian = false,                                               \
    cfg.bit_order_lsb = false,                                            \
    cfg.skip_mask = false                                                 \

#define I2S_PDM_TX_SLOT_DEFAULT_CONFIG(cfg)                   \
    cfg.sd_prescale = 0,                                      \
    cfg.sd_scale = I2S_PDM_SIG_SCALING_MUL_1,                 \
    cfg.hp_scale = I2S_PDM_SIG_SCALING_DIV_2,                 \
    cfg.lp_scale = I2S_PDM_SIG_SCALING_MUL_1,                 \
    cfg.sinc_scale = I2S_PDM_SIG_SCALING_MUL_1,               \
    cfg.line_mode = I2S_PDM_TX_ONE_LINE_CODEC,                \
    cfg.hp_en = true,                                         \
    cfg.hp_cut_off_freq_hzx10 = 35.5,                         \
    cfg.sd_dither = 0,                                        \
    cfg.sd_dither2 = 1                                        \

#if SOC_CACHE_INTERNAL_MEM_VIA_L1CACHE
#  define I2S_DMA_BUFFER_MAX_SIZE   DMA_DESCRIPTOR_BUFFER_MAX_SIZE_64B_ALIGNED
#else
#  define I2S_DMA_BUFFER_MAX_SIZE   DMA_DESCRIPTOR_BUFFER_MAX_SIZE_4B_ALIGNED
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* Multiplier of MCLK to sample rate */

