sc750/nuttx/arch/risc-v/src/esp32p4/espressif/esp_i2s.c
typedef enum
{
  I2S_MCLK_MULTIPLE_128 = 128,  /* mclk = sample_rate * 128 */
  I2S_MCLK_MULTIPLE_256 = 256,  /* mclk = sample_rate * 256 */
  I2S_MCLK_MULTIPLE_384 = 384,  /* mclk = sample_rate * 384 */
  I2S_MCLK_MULTIPLE_512 = 512,  /* mclk = sample_rate * 512 */
} i2s_mclk_multiple_t;

/* I2S Audio Standard Mode */

typedef enum
{
  I2S_TDM_PHILIPS = 0,
  I2S_TDM_MSB,
  I2S_TDM_PCM,
  I2S_PDM,
} i2s_audio_mode_t;

/* I2S Device hardware configuration */

struct esp_i2s_config_s
{
  uint32_t port;                    /* I2S port */
  uint32_t role;                    /* I2S port role (master or slave) */
  uint8_t data_width;               /* I2S sample data width */
  uint32_t rate;                    /* I2S sample-rate */
  uint32_t total_slot;              /* Total slot number */

  bool tx_en;                       /* Is TX enabled? */
  bool rx_en;                       /* Is RX enabled? */
  int8_t mclk_pin;                  /* MCLK pin, output */

  int tx_clk_src;                   /* Select the I2S TX source clock */
  int rx_clk_src;                   /* Select the I2S TX source clock */

  /* BCLK pin, input in slave role, output in master role */

  int8_t bclk_pin;

  /* WS pin, input in slave role, output in master role */

  int8_t ws_pin;

  int8_t dout_pin;                  /* DATA pin, output */
  int8_t din_pin;                   /* DATA pin, input */

  uint8_t  audio_std_mode;          /* Select audio standard (i2s_audio_mode_t) */

  /* WS signal polarity, set true to enable high level first */

  bool ws_pol;

  i2s_hal_context_t *ctx;           /* Common layer struct */
  i2s_hal_clock_info_t *clk_info;   /* Common layer clock info struct */
#ifdef CONFIG_PM
  esp_pm_lock_handle_t pm_lock;     /* Power management lock */
#endif
};

struct esp_buffer_s
{
  struct esp_buffer_s *flink; /* Supports a singly linked list */

  /* The associated DMA in/outlink */

  lldesc_t *dma_link[I2S_DMADESC_NUM];

  i2s_callback_t callback;      /* DMA completion callback */
  uint32_t timeout;             /* Timeout value of the DMA transfers */
  void *arg;                    /* Callback's argument */
  struct ap_buffer_s *apb;      /* The audio buffer */
  uint8_t *buf;                 /* The DMA's descriptor buffer */
  uint32_t nbytes;              /* The DMA's descriptor buffer size */
  int result;                   /* The result of the transfer */
};

/* Internal buffer must be aligned to the bytes_per_frame. Sometimes,
 * however, the audio buffer is not aligned and additional bytes must
 * be copied to be inserted on the next buffer. This structure keeps
 * track of the bytes that were not written to the internal buffer yet.
 */

struct esp_buffer_carry_s
{
  uint32_t value;
  size_t bytes;
};

/* This structure describes the state of one receiver or transmitter
 * transport.
 */

struct esp_transport_s
{
  sq_queue_t pend;              /* A queue of pending transfers */
  sq_queue_t act;               /* A queue of active transfers */
  sq_queue_t done;              /* A queue of completed transfers */
  struct work_s work;           /* Supports worker thread operations */

  /* Bytes to be written at the beginning of the next DMA buffer */

  struct esp_buffer_carry_s carry;
};

/* The state of the one I2S peripheral */

struct esp_i2s_s
{
  struct i2s_dev_s  dev;        /* Externally visible I2S interface */
  mutex_t           lock;       /* Ensures mutually exclusive access */
  uint8_t           cpu;        /* CPU ID */
  spinlock_t        slock;      /* Device specific lock. */

  /* Port configuration */

  const struct esp_i2s_config_s *config;

  uint32_t               mclk_freq;      /* I2S actual master clock */
  uint32_t               mclk_multiple;  /* The multiple of mclk to the sample rate */
  uint32_t               channels;       /* Audio channels (1:mono or 2:stereo) */
  uint32_t               rate;           /* I2S actual configured sample-rate */
  uint32_t               data_width;     /* I2S actual configured data_width */
  gdma_channel_handle_t  dma_channel_tx; /* I2S DMA TX channel being used */
  gdma_channel_handle_t  dma_channel_rx; /* I2S DMA RX channel being used */

  struct esp_transport_s tx;  /* TX transport state */

  bool tx_started;                /* TX channel started */

  struct esp_transport_s rx;  /* RX transport state */

  bool rx_started;                /* RX channel started */

  bool streaming;                 /* Is I2S peripheral active? */

  /* Pre-allocated pool of buffer containers */

  sem_t bufsem;                         /* Buffer wait semaphore */
  struct esp_buffer_s *bf_freelist;     /* A list a free buffer containers */
  struct esp_buffer_s containers[CONFIG_ESPRESSIF_I2S_MAXINFLIGHT];
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Register helpers */

#ifdef CONFIG_ESPRESSIF_I2S_DUMPBUFFERS
#  define       i2s_dump_buffer(m,b,s) lib_dumpbuffer(m,b,s)
#else
#  define       i2s_dump_buffer(m,b,s)
#endif

/* I2S configuration */

static int i2s_configure(struct esp_i2s_s *priv);

/* Buffer container helpers */

static struct esp_buffer_s *
                i2s_buf_allocate(struct esp_i2s_s *priv);
static int      i2s_buf_free(struct esp_i2s_s *priv,
                             struct esp_buffer_s *bfcontainer);
static int      i2s_buf_initialize(struct esp_i2s_s *priv);

/* I2S DMA setup function */

static uint32_t i2s_common_dma_setup(struct esp_buffer_s *bfcontainer,
                                     bool tx, uint32_t len);

/* DMA support */

static IRAM_ATTR int  i2s_txdma_setup(struct esp_i2s_s *priv,
                                      struct esp_buffer_s *bfcontainer);
static void           i2s_tx_worker(void *arg);
static void           i2s_tx_schedule(struct esp_i2s_s *priv,
                                      lldesc_t *outlink);

static IRAM_ATTR int  i2s_rxdma_setup(struct esp_i2s_s *priv,
                                      struct esp_buffer_s *bfcontainer);
static void           i2s_rx_worker(void *arg);
static void           i2s_rx_schedule(struct esp_i2s_s *priv,
                                      lldesc_t *inlink);

