sc750/nuttx/arch/risc-v/src/esp32p4/espressif/esp_i2s.c
/* I2S methods (and close friends) */
#if SOC_I2S_SUPPORTS_APLL
static uint32_t i2s_set_get_apll_freq(uint32_t mclk_freq_hz);
#endif
static uint32_t i2s_get_source_clk_freq(i2s_clock_src_t clk_src,
                                        uint32_t mclk_freq_hz);
static int32_t  i2s_check_mclkfrequency(struct esp_i2s_s *priv);
static uint32_t i2s_set_datawidth(struct esp_i2s_s *priv);
static int      i2s_set_clock(struct esp_i2s_s *priv);
static int32_t  i2s_getmclkfrequency(struct i2s_dev_s *dev);
static int32_t  i2s_setmclkfrequency(struct i2s_dev_s *dev,
                                     uint32_t frequency);
static int      i2s_ioctl(struct i2s_dev_s *dev, int cmd, unsigned long arg);

static void     i2s_tx_channel_start(struct esp_i2s_s *priv);
static int      i2s_tx_channel_stop(struct esp_i2s_s *priv);
static int      i2s_txchannels(struct i2s_dev_s *dev, uint8_t channels);
static int32_t  i2s_txsamplerate(struct i2s_dev_s *dev, uint32_t rate);
static int32_t  i2s_txdatawidth(struct i2s_dev_s *dev, int bits);
static int      i2s_send(struct i2s_dev_s *dev, struct ap_buffer_s *apb,
                         i2s_callback_t callback, void *arg,
                         uint32_t timeout);

static void     i2s_rx_channel_start(struct esp_i2s_s *priv);
static int      i2s_rx_channel_stop(struct esp_i2s_s *priv);
static bool     i2s_tx_error(gdma_channel_handle_t dma_chan,
                             gdma_event_data_t *event_data,
                             void *arg);
static bool     i2s_rx_error(gdma_channel_handle_t dma_chan,
                             gdma_event_data_t *event_data,
                             void *arg);

static int      i2s_rxchannels(struct i2s_dev_s *dev, uint8_t channels);
static int32_t  i2s_rxsamplerate(struct i2s_dev_s *dev, uint32_t rate);
static int32_t  i2s_rxdatawidth(struct i2s_dev_s *dev, int bits);
static int      i2s_receive(struct i2s_dev_s *dev, struct ap_buffer_s *apb,
                            i2s_callback_t callback, void *arg,
                            uint32_t timeout);

/****************************************************************************
 * Private Data
 ****************************************************************************/

static const struct i2s_ops_s g_i2sops =
{
  .i2s_txchannels     = i2s_txchannels,
  .i2s_txsamplerate   = i2s_txsamplerate,
  .i2s_txdatawidth    = i2s_txdatawidth,
  .i2s_send           = i2s_send,

  .i2s_rxchannels     = i2s_rxchannels,
  .i2s_rxsamplerate   = i2s_rxsamplerate,
  .i2s_rxdatawidth    = i2s_rxdatawidth,
  .i2s_receive        = i2s_receive,

  .i2s_ioctl             = i2s_ioctl,
  .i2s_getmclkfrequency  = i2s_getmclkfrequency,
  .i2s_setmclkfrequency  = i2s_setmclkfrequency,
};

#ifdef CONFIG_ESPRESSIF_I2S0

i2s_hal_context_t ctx_i2s0 =
{
  0
};

i2s_hal_clock_info_t clk_info_i2s0 =
{
  0
};

static struct esp_i2s_config_s esp_i2s0_config =
{
  .port             = 0,
#ifdef CONFIG_ESPRESSIF_I2S0_ROLE_MASTER
  .role             = I2S_ROLE_MASTER,
#else
  .role             = I2S_ROLE_SLAVE,
#endif /* CONFIG_ESPRESSIF_I2S0_ROLE_MASTER */
  .data_width       = ESPRESSIF_I2S0_DATA_BIT_WIDTH,
  .rate             = CONFIG_ESPRESSIF_I2S0_SAMPLE_RATE,
  .total_slot       = 2,
  .tx_en            = I2S0_TX_ENABLED,
  .rx_en            = I2S0_RX_ENABLED,
  .tx_clk_src       = I2S_CLK_SRC_DEFAULT,
  .rx_clk_src       = I2S_CLK_SRC_DEFAULT,
#ifdef CONFIG_ESPRESSIF_I2S0_MCLK
  .mclk_pin         = CONFIG_ESPRESSIF_I2S0_MCLKPIN,
#else
  .mclk_pin         = I2S_GPIO_UNUSED,
#endif /* CONFIG_ESPRESSIF_I2S0_MCLK */
  .bclk_pin         = CONFIG_ESPRESSIF_I2S0_BCLKPIN,
  .ws_pin           = CONFIG_ESPRESSIF_I2S0_WSPIN,
#ifdef CONFIG_ESPRESSIF_I2S0_DOUTPIN
  .dout_pin         = CONFIG_ESPRESSIF_I2S0_DOUTPIN,
#else
  .dout_pin         = I2S_GPIO_UNUSED,
#endif /* CONFIG_ESPRESSIF_I2S0_DOUTPIN */
#ifdef CONFIG_ESPRESSIF_I2S0_DINPIN
  .din_pin          = CONFIG_ESPRESSIF_I2S0_DINPIN,
#else
  .din_pin          = I2S_GPIO_UNUSED,
#endif /* CONFIG_ESPRESSIF_I2S0_DINPIN */
  .audio_std_mode   = I2S_TDM_PHILIPS,
  .ctx              = &ctx_i2s0,
  .clk_info         = &clk_info_i2s0,
#ifdef CONFIG_PM
  .pm_lock          = NULL,
#endif
};

static struct esp_i2s_s esp_i2s0_priv =
{
  .dev =
  {
    .ops = &g_i2sops,
  },
  .lock = NXMUTEX_INITIALIZER,
  .slock = SP_UNLOCKED,
  .config = &esp_i2s0_config,
  .bufsem = SEM_INITIALIZER(0),
};
#endif /* CONFIG_ESPRESSIF_I2S0 */

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: i2s_buf_allocate
 *
 * Description:
 *   Allocate a buffer container by removing the one at the head of the
 *   free list
 *
 * Input Parameters:
 *   priv - Initialized I2S device structure.
 *
 * Returned Value:
 *   A non-NULL pointer to the allocate buffer container on success; NULL if
 *   there are no available buffer containers.
 *
 * Assumptions:
 *   The caller does NOT have exclusive access to the I2S state structure.
 *   That would result in a deadlock!
 *
 ****************************************************************************/

static struct esp_buffer_s *i2s_buf_allocate(struct esp_i2s_s *priv)
{
  struct esp_buffer_s *bfcontainer;
  irqstate_t flags;
  int ret;
  int alignment;
  int i;

  /* Set aside a buffer container.  By doing this, we guarantee that we will
   * have at least one free buffer container.
   */

  ret = nxsem_wait_uninterruptible(&priv->bufsem);
  if (ret < 0)
    {
      return NULL;
    }

  /* Get the buffer from the head of the free list */

  flags = spin_lock_irqsave(&priv->slock);
  bfcontainer = priv->bf_freelist;
  DEBUGASSERT(bfcontainer);

#if SOC_CACHE_INTERNAL_MEM_VIA_L1CACHE
  alignment = cache_hal_get_cache_line_size(CACHE_LL_LEVEL_INT_MEM,
                                            CACHE_TYPE_DATA);
#else
  alignment = sizeof(uint32_t);
#endif

  for (i = 0; i < I2S_DMADESC_NUM; i++)
    {
      size_t size = ALIGN_UP(sizeof(lldesc_t), alignment);
      bfcontainer->dma_link[i] = (lldesc_t *)kmm_memalign(alignment, size);
    }

  /* Unlink the buffer from the freelist */

  priv->bf_freelist = bfcontainer->flink;
  spin_unlock_irqrestore(&priv->slock, flags);
  return bfcontainer;
}

/****************************************************************************
 * Name: i2s_buf_free
 *
 * Description:
 *   Free buffer container by adding it to the head of the free list
 *
 * Input Parameters:
 *   priv        - Initialized I2S device structure.
 *   bfcontainer - The buffer container to be freed
 *
 * Returned Value:
 *   OK on success; a negated errno value on failure.
 *
 * Assumptions:
 *   The caller has exclusive access to the I2S state structure
 *
 ****************************************************************************/

static int i2s_buf_free(struct esp_i2s_s *priv,
                        struct esp_buffer_s *bfcontainer)
{
  irqstate_t flags;
  int i;

  /* Put the buffer container back on the free list (circbuf) */

  flags = spin_lock_irqsave(&priv->slock);

  for (i = 0; i < I2S_DMADESC_NUM; i++)
    {
      kmm_free(bfcontainer->dma_link[i]);
      bfcontainer->dma_link[i] = NULL;
    }

  bfcontainer->apb = NULL;
  bfcontainer->buf = NULL;
  bfcontainer->nbytes = 0;
  bfcontainer->flink  = priv->bf_freelist;
  priv->bf_freelist = bfcontainer;

  spin_unlock_irqrestore(&priv->slock, flags);

  /* Wake up any threads waiting for a buffer container */

  return nxsem_post(&priv->bufsem);
}

/****************************************************************************
 * Name: i2s_buf_initialize
 *
 * Description:
 *   Initialize the buffer container allocator by adding all of the
 *   pre-allocated buffer containers to the free list
 *
 * Input Parameters:
 *   priv - Initialized I2S device structure.
 *
 * Returned Value:
 *   OK on success; A negated errno value on failure.
 *
 * Assumptions:
 *   Called early in I2S initialization so that there are no issues with
 *   concurrency.
 *
 ****************************************************************************/

static int i2s_buf_initialize(struct esp_i2s_s *priv)
{
  int ret;

  priv->tx.carry.bytes = 0;
  priv->tx.carry.value = 0;

  priv->bf_freelist = NULL;
  for (int i = 0; i < CONFIG_ESPRESSIF_I2S_MAXINFLIGHT; i++)
    {
      ret = i2s_buf_free(priv, &priv->containers[i]);
      if (ret < 0)
        {
          i2serr("Failed to free buffer container: %d\n", ret);
          return ret;
        }
    }

  return OK;
}

/****************************************************************************
 * Name: i2s_common_dma_setup
 *
 * Description:
 *   Set up I2S DMA descriptors with given parameters using lldesc_t.
 *   This function is based on esp_dma_setup but adapted for I2S using
 *   lldesc_t descriptors and struct esp_buffer_s.
 *
 * Input Parameters:
 *   bfcontainer - Buffer container with DMA descriptors
 *   tx          - true: TX mode; false: RX mode
 *   len         - Buffer length by byte
 *
 * Returned Value:
 *   Number of bytes bound to descriptors
 *
 ****************************************************************************/

static uint32_t i2s_common_dma_setup(struct esp_buffer_s *bfcontainer,
                                     bool tx, uint32_t len)
{
  int i;
  uint32_t bytes = len;
  uint8_t *pdata = bfcontainer->buf;
  uint32_t data_len;
  uint32_t buf_len;
  lldesc_t *dma_desc;

