sc750/nuttx/arch/risc-v/src/esp32p4/espressif/esp_i2s.c
  DEBUGASSERT(bfcontainer != NULL);
  DEBUGASSERT(bfcontainer->dma_link != NULL);
  DEBUGASSERT(bfcontainer->buf != NULL);
  DEBUGASSERT(len > 0);

  for (i = 0; i < I2S_DMADESC_NUM; i++)
    {
      data_len = MIN(bytes, I2S_DMA_BUFFER_MAX_SIZE);

      /* Buffer length must be rounded to next 32-bit boundary. */

      buf_len = ALIGN_UP(data_len, sizeof(uintptr_t));

      dma_desc = bfcontainer->dma_link[i];
      dma_desc->size = buf_len;
      dma_desc->length = tx ? data_len : 0;
      dma_desc->owner = DMA_DESCRIPTOR_BUFFER_OWNER_DMA;
      dma_desc->buf = pdata;
      dma_desc->eof = 0;
      dma_desc->sosf = 0;
      dma_desc->offset = 0;

      /* Link to the next descriptor */

      if (i < (I2S_DMADESC_NUM - 1))
        {
          STAILQ_NEXT(dma_desc, qe) = bfcontainer->dma_link[i + 1];
        }
      else
        {
          STAILQ_NEXT(dma_desc, qe) = NULL;
        }

#if SOC_CACHE_INTERNAL_MEM_VIA_L1CACHE
      esp_cache_msync(dma_desc, sizeof(lldesc_t),
                      ESP_CACHE_MSYNC_FLAG_DIR_C2M | \
                      ESP_CACHE_MSYNC_FLAG_UNALIGNED);
#endif

      bytes -= data_len;
      if (bytes == 0)
        {
          break;
        }

      pdata += data_len;
    }

  /* Set EOF flag on the last descriptor */

  dma_desc->eof = tx ? 1 : 0;

  /* Set the next pointer to NULL on the last descriptor */

  STAILQ_NEXT(dma_desc, qe) = NULL;

#if SOC_CACHE_INTERNAL_MEM_VIA_L1CACHE
  esp_cache_msync(dma_desc, sizeof(lldesc_t),
                  ESP_CACHE_MSYNC_FLAG_DIR_C2M | \
                  ESP_CACHE_MSYNC_FLAG_UNALIGNED);
#endif

  return len - bytes;
}

/****************************************************************************
 * Name: i2s_txdma_start
 *
 * Description:
 *   Initiate the next TX DMA transfer. The DMA outlink was previously bound
 *   so it is safe to start the next DMA transfer at interrupt level.
 *
 * Input Parameters:
 *   priv - Initialized I2S device structure.
 *
 * Returned Value:
 *   OK on success; a negated errno value on failure
 *
 * Assumptions:
 *   Interrupts are disabled
 *
 ****************************************************************************/

static int IRAM_ATTR i2s_txdma_start(struct esp_i2s_s *priv)
{
  struct esp_buffer_s *bfcontainer;
  esp_err_t err;

  /* If there is already an active transmission in progress, then bail
   * returning success.
   */

  if (!sq_empty(&priv->tx.act))
    {
      return OK;
    }

  /* If there are no pending transfer, then bail returning success */

  if (sq_empty(&priv->tx.pend))
    {
      return OK;
    }

  i2s_hal_tx_reset(priv->config->ctx);

  /* Reset the DMA operation */

  err = gdma_reset(priv->dma_channel_tx);
  if (err != ESP_OK)
    {
      i2serr("Failed to reset DMA channel: %d\n", err);
      return -EINVAL;
    }

  /* Reset TX FIFO */

  i2s_hal_tx_reset_fifo(priv->config->ctx);

  /* Start transmission if no data is already being transmitted */

  bfcontainer = (struct esp_buffer_s *)sq_remfirst(&priv->tx.pend);

  err = gdma_start(priv->dma_channel_tx, (intptr_t)bfcontainer->dma_link[0]);
  if (err != ESP_OK)
    {
      i2serr("Failed to start DMA channel: %d\n", err);
      return -EINVAL;
    }

  i2s_hal_tx_start(priv->config->ctx);

  priv->tx_started = true;

  sq_addlast((sq_entry_t *)bfcontainer, &priv->tx.act);

  return OK;
}

/****************************************************************************
 * Name: i2s_rxdma_start
 *
 * Description:
 *   Initiate the next RX DMA transfer. Assuming the DMA inlink is already
 *   bound, it's safe to start the next DMA transfer in an interrupt context.
 *
 * Input Parameters:
 *   priv - Initialized I2S device structure.
 *
 * Returned Value:
 *   OK on success; a negated errno value on failure
 *
 * Assumptions:
 *   Interrupts are disabled
 *
 ****************************************************************************/

static int i2s_rxdma_start(struct esp_i2s_s *priv)
{
  struct esp_buffer_s *bfcontainer;
  size_t eof_nbytes;
  esp_err_t err;

  /* If there is already an active transmission in progress, then bail
   * returning success.
   */

  if (!sq_empty(&priv->rx.act))
    {
      return OK;
    }

  /* If there are no pending transfer, then bail returning success */

  if (sq_empty(&priv->rx.pend))
    {
      return OK;
    }

  i2s_hal_rx_reset(priv->config->ctx);

  /* Reset the DMA operation */

  err = gdma_reset(priv->dma_channel_rx);
  if (err != ESP_OK)
    {
      i2serr("Failed to reset DMA channel: %d\n", err);
      return -EINVAL;
    }

  /* Reset RX FIFO */

  i2s_hal_rx_reset_fifo(priv->config->ctx);

  bfcontainer = (struct esp_buffer_s *)sq_remfirst(&priv->rx.pend);

  eof_nbytes = MIN(bfcontainer->nbytes, I2S_DMA_BUFFER_MAX_SIZE);

  i2s_ll_rx_set_eof_num(priv->config->ctx->dev, eof_nbytes);

  /* If there isn't already an active transmission in progress,
   * then start it.
   */

  err = gdma_start(priv->dma_channel_rx, (intptr_t)bfcontainer->dma_link[0]);
  if (err != ESP_OK)
    {
      i2serr("Failed to start DMA channel: %d\n", err);
      return -EINVAL;
    }

  i2s_hal_rx_start(priv->config->ctx);

  priv->rx_started = true;

  sq_addlast((sq_entry_t *)bfcontainer, &priv->rx.act);

  return OK;
}

/****************************************************************************
 * Name: i2s_txdma_setup
 *
 * Description:
 *   Setup the next TX DMA transfer
 *
 * Input Parameters:
 *   priv        - Initialized I2S device structure.
 *   bfcontainer - The buffer container to be set up
 *
 * Returned Value:
 *   OK on success; a negated errno value on failure
 *
 * Assumptions:
 *   Interrupts are disabled
 *
 ****************************************************************************/

static IRAM_ATTR int i2s_txdma_setup(struct esp_i2s_s *priv,
                                     struct esp_buffer_s *bfcontainer)
{
  int ret = OK;
  size_t carry_size;
  uint32_t bytes_queued;
  uint32_t data_copied;
  struct ap_buffer_s *apb;
  apb_samp_t samp_size;
  apb_samp_t bytes_per_sample;
  uint16_t bytes_per_frame;
  irqstate_t flags;
  uint8_t *buf;
  uint8_t padding;
  uint8_t *samp;
  uint32_t alignment;
#if SOC_CACHE_INTERNAL_MEM_VIA_L1CACHE
  uint32_t bufsize;
#endif

