sc750/nuttx/arch/risc-v/src/esp32p4/espressif/esp_i2s.c
  DEBUGASSERT(bfcontainer && bfcontainer->apb);

  apb = bfcontainer->apb;

  /* Get the transfer information, accounting for any data offset */

  bytes_per_sample = (priv->data_width + 7) / 8;
  bytes_per_frame = bytes_per_sample * priv->channels;

  samp = &apb->samp[apb->curbyte];
  samp_size = (apb->nbytes - apb->curbyte) + priv->tx.carry.bytes;

#if SOC_CACHE_INTERNAL_MEM_VIA_L1CACHE
  /* bufsize need to align with cache line size */

  bufsize = samp_size;
  alignment = cache_hal_get_cache_line_size(CACHE_LL_LEVEL_INT_MEM,
                                            CACHE_TYPE_DATA);

  /* First, calculate if the buffer contains a complete sample */

  carry_size = samp_size % bytes_per_frame;

  bufsize -= carry_size;

  /* Now, the buffer contains complete samples */

  uint32_t aligned_frame_num = bufsize / bytes_per_frame;

  /* To make the buffer aligned with the cache line size, search for the ceil
   * aligned size first. If the buffer size exceed the max DMA buffer size,
   * toggle the sign to search for the floor aligned size.
   */

  for (; bufsize % alignment != 0; aligned_frame_num--)
    {
      bufsize = aligned_frame_num * bytes_per_frame;
      carry_size += bytes_per_frame;
    }

  DEBUGASSERT((samp_size - carry_size) % alignment == 0);

#else
  alignment = sizeof(uint32_t);
  carry_size = samp_size % bytes_per_frame;
#endif

  DEBUGASSERT((samp_size - carry_size) % bytes_per_frame == 0);

  /* Allocate the current audio buffer considering the remaining bytes
   * carried from the last upper half audio buffer.
   */

  bfcontainer->buf = kmm_memalign(alignment, bfcontainer->nbytes);
  if (bfcontainer->buf == NULL)
    {
      i2serr("Failed to allocate the DMA internal buffer "
             "[%" PRIu32 " bytes]", bfcontainer->nbytes);
      return -ENOMEM;
    }

  data_copied = 0;
  buf = bfcontainer->buf;

  /* Copy the remaining bytes from the last audio buffer to the current
   * audio buffer. The remaining bytes are part of a sample that was split
   * between the last and the current audio buffer. Also, copy the bytes
   * from that split sample that are on the current buffer to the internal
   * buffer.
   */

  if (priv->tx.carry.bytes)
    {
      memcpy(buf, &priv->tx.carry.value, priv->tx.carry.bytes);
      buf += priv->tx.carry.bytes;
      data_copied += priv->tx.carry.bytes;
      memcpy(buf, samp, (bytes_per_frame - priv->tx.carry.bytes));
      buf += (bytes_per_frame - priv->tx.carry.bytes);
      samp += (bytes_per_frame - priv->tx.carry.bytes);
      data_copied += (bytes_per_frame - priv->tx.carry.bytes);
    }

  /* Copy the upper half buffer to the internal buffer considering that
   * the current upper half buffer may not contain a complete sample at
   * the end of the buffer (and those bytes needs to be carried to the
   * next audio buffer).
   */

  memcpy(buf, samp, samp_size - (data_copied + carry_size));
  buf += samp_size - (data_copied + carry_size);
  samp += samp_size - (data_copied + carry_size);
  data_copied += samp_size - (data_copied + carry_size);

  /* If the audio buffer's size is not a multiple of the sample size,
   * it's necessary to carry the remaining bytes that are part of what
   * would be the last sample on this buffer. These bytes will then be
   * saved and inserted at the beginning of the next DMA buffer to
   * rebuild the sample correctly.
   */

  priv->tx.carry.bytes = carry_size;
  if (priv->tx.carry.bytes)
    {
      memcpy((uint8_t *)&priv->tx.carry.value, samp, priv->tx.carry.bytes);
    }

#if SOC_CACHE_INTERNAL_MEM_VIA_L1CACHE
  esp_cache_msync((void *)bfcontainer->buf,
                  bfcontainer->nbytes,
                  ESP_CACHE_MSYNC_FLAG_DIR_C2M);
#endif

  /* Configure DMA stream */

  bytes_queued = i2s_common_dma_setup(bfcontainer,
                                      true,
                                      bfcontainer->nbytes);

  if (bytes_queued != bfcontainer->nbytes)
    {
      i2serr("Failed to enqueue I2S buffer "
             "(%" PRIu32 " bytes of %" PRIu32 ")\n",
             bytes_queued, bfcontainer->nbytes);
      return -bytes_queued;
    }

  flags = spin_lock_irqsave(&priv->slock);

  /* Add the buffer container to the end of the TX pending queue */

  sq_addlast((sq_entry_t *)bfcontainer, &priv->tx.pend);

  /* Trigger DMA transfer if no transmission is in progress */

  ret = i2s_txdma_start(priv);

  spin_unlock_irqrestore(&priv->slock, flags);

  return ret;
}

/****************************************************************************
 * Name: i2s_rxdma_setup
 *
 * Description:
 *   Setup the next RX DMA transfer
 *
 * Input Parameters:
 *   priv - Initialized I2S device structure.
 *   bfcontainer - The buffer container to be set up
 *
 * Returned Value:
 *   OK on success; a negated errno value on failure
 *
 * Assumptions:
 *   Interrupts are disabled
 *
 ****************************************************************************/

static IRAM_ATTR int i2s_rxdma_setup(struct esp_i2s_s *priv,
                                     struct esp_buffer_s *bfcontainer)
{
  int ret = OK;
  uint32_t bytes_queued;
  irqstate_t flags;
  uint32_t alignment;

  DEBUGASSERT(bfcontainer && bfcontainer->apb);

#if SOC_CACHE_INTERNAL_MEM_VIA_L1CACHE
  /* bufsize need to align with cache line size */

  alignment = cache_hal_get_cache_line_size(CACHE_LL_LEVEL_INT_MEM,
                                            CACHE_TYPE_DATA);
#else
  alignment = sizeof(uint32_t);
#endif

  bfcontainer->buf = kmm_memalign(alignment, bfcontainer->nbytes);

#if SOC_CACHE_INTERNAL_MEM_VIA_L1CACHE
  esp_cache_msync((void *)bfcontainer,
                  sizeof(struct esp_buffer_s),
                  (ESP_CACHE_MSYNC_FLAG_DIR_C2M |
                   ESP_CACHE_MSYNC_FLAG_UNALIGNED));
#endif

  /* Configure DMA stream */

  bytes_queued = i2s_common_dma_setup(bfcontainer,
                                      false,
                                      bfcontainer->nbytes);

  if (bytes_queued != bfcontainer->nbytes)
    {
      i2serr("Failed to enqueue I2S buffer "
             "(%" PRIu32 " bytes of %" PRIu32 ")\n",
             bytes_queued, bfcontainer->nbytes);
      return -bytes_queued;
    }

  flags = spin_lock_irqsave(&priv->slock);

  /* Add the buffer container to the end of the RX pending queue */

