sc750/nuttx/arch/risc-v/src/esp32p4/espressif/esp_i2s.c
      /* Perform the TX transfer done callback */

      DEBUGASSERT(bfcontainer && bfcontainer->callback);
      bfcontainer->callback(&priv->dev, bfcontainer->apb,
                            bfcontainer->arg, bfcontainer->result);

      /* Release the internal buffer used by the DMA outlink */

      kmm_free(bfcontainer->buf);

      /* And release the buffer container */

      VERIFY(i2s_buf_free(priv, bfcontainer));
    }

  /* TX channel can only be stopped here if either 1) the RX channel is
   * disabled or 2) the I2S is in slave role. If the I2S is in master role,
   * the TX channel can only be stopped after the RX channel has finished
   * because the WS and BCLK are shared with the RX.
   */

  if ((!priv->config->rx_en || priv->config->role == I2S_ROLE_SLAVE) &&
      (sq_empty(&priv->tx.act) && sq_empty(&priv->tx.pend)))
    {
      i2s_tx_channel_stop(priv);

      /* If the I2S is in slave role and RX is enabled, the TX's WS and
       * BCLK are shared with the RX. Then, the RX channel can only be
       * stopped after the TX channel has finished.
       */

      if ((priv->config->rx_en) &&
          (sq_empty(&priv->rx.act) && sq_empty(&priv->rx.pend)))
        {
          i2s_rx_channel_stop(priv);
        }
    }
}

/****************************************************************************
 * Name: i2s_rx_worker
 *
 * Description:
 *   RX transfer done worker
 *
 * Input Parameters:
 *   arg - the I2S device instance cast to void*
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void i2s_rx_worker(void *arg)
{
  struct esp_i2s_s *priv = (struct esp_i2s_s *)arg;
  struct esp_buffer_s *bfcontainer;
  lldesc_t *dmadesc;
  irqstate_t flags;

  DEBUGASSERT(priv);

  /* When the transfer was started, the active buffer containers were removed
   * from the rx.pend queue and saved in the rx.act queue. We get here when
   * the DMA is finished.
   *
   * In any case, the buffer containers in rx.act will be moved to the end
   * of the rx.done queue and rx.act will be emptied before this worker is
   * started.
   *
   */

  i2sinfo("rx.act.head=%p rx.done.head=%p\n",
          priv->rx.act.head, priv->rx.done.head);

  /* Process each buffer in the rx.done queue */

  while (sq_peek(&priv->rx.done) != NULL)
    {
      /* Remove the buffer container from the rx.done queue.  NOTE that
       * interrupts must be disabled to do this because the rx.done queue is
       * also modified from the interrupt level.
       */

      flags = spin_lock_irqsave(&priv->slock);
      bfcontainer = (struct esp_buffer_s *)sq_remfirst(&priv->rx.done);
      spin_unlock_irqrestore(&priv->slock, flags);

      bfcontainer->apb->nbytes = 0;

      dmadesc = bfcontainer->dma_link[0];

      do
        {
          memcpy(bfcontainer->apb->samp + bfcontainer->apb->nbytes,
                 (const void *)dmadesc->buf,
                 dmadesc->length);
          bfcontainer->apb->nbytes += dmadesc->length;
          dmadesc = STAILQ_NEXT(dmadesc, qe);
        }
      while (dmadesc != NULL && dmadesc->eof == 1);

      /* Perform the RX transfer done callback */

      DEBUGASSERT(bfcontainer && bfcontainer->callback);

      if (priv->streaming == false)
        {
          bfcontainer->apb->flags |= AUDIO_APB_FINAL;
        }

      bfcontainer->callback(&priv->dev, bfcontainer->apb,
                            bfcontainer->arg, bfcontainer->result);

      /* Release the internal buffer used by the DMA inlink */

      kmm_free(bfcontainer->buf);

      /* And release the buffer container */

      VERIFY(i2s_buf_free(priv, bfcontainer));
    }

  /* RX channel can only be stopped here if either 1) the TX channel is
   * disabled or 2) the I2S is in master role. If the I2S is in slave role,
   * the RX channel can only be stopped after the TX channel has finished
   * because the WS and BCLK are shared with the TX.
   */

  if ((!priv->config->tx_en || priv->config->role == I2S_ROLE_MASTER) &&
      (sq_empty(&priv->rx.act) && sq_empty(&priv->rx.pend)))
    {
      i2s_rx_channel_stop(priv);

      /* If the I2S is in master role and TX is enabled, the RX's WS and
       * BCLK are shared with the TX. Then, the TX channel can only be
       * stopped after the RX channel has finished.
       */

      if ((priv->config->tx_en) &&
          (sq_empty(&priv->tx.act) && sq_empty(&priv->tx.pend)))
        {
          i2s_tx_channel_stop(priv);
        }
    }
}

/****************************************************************************
 * Name: i2s_configure
 *
 * Description:
 *   Configure I2S
 *
 * Input Parameters:
 *   priv - Partially initialized I2S device structure.  This function
 *          will complete the I2S specific portions of the initialization
 *
 * Returned Value:
 *   Returns OK on success, a negative error code on failure
 *
 ****************************************************************************/

static int i2s_configure(struct esp_i2s_s *priv)
{
  uint32_t tx_conf  = 0;
  uint32_t rx_conf  = 0;
  uint32_t port;
  int ret;
  i2s_hal_slot_config_t tx_slot_cfg =
    {
      0
    };

  i2s_hal_slot_config_t rx_slot_cfg =
    {
      0
    };

  port = priv->config->port;

  i2s_hal_init(priv->config->ctx, port);
  PERIPH_RCC_ATOMIC()
    {
      i2s_ll_enable_bus_clock(port, true);
      i2s_ll_reset_register(port);
      i2s_ll_enable_core_clock(I2S_LL_GET_HW(port), true);
    }

  /* Configure multiplexed pins as connected on the board */

  /* Enable TX channel */

  if (priv->config->dout_pin != I2S_GPIO_UNUSED)
    {
      /* If TX channel is used, enable the clock source */

      esp_gpiowrite(priv->config->dout_pin, 1);
      esp_gpiowrite(priv->config->dout_pin, 0);
      esp_gpiowrite(priv->config->dout_pin, 1);
      esp_configgpio(priv->config->dout_pin, OUTPUT_FUNCTION_2);
      esp_gpio_matrix_out(priv->config->dout_pin,
                          i2s_periph_signal[port].data_out_sigs[0], 0, 0);
    }

  /* Enable RX channel */

  if (priv->config->din_pin != I2S_GPIO_UNUSED)
    {
      /* If RX channel is used, enable the clock source */

