sc750/nuttx/arch/risc-v/src/esp32p4/espressif/esp_i2s.c
      /* Check for loopback mode */

      if (priv->config->dout_pin != I2S_GPIO_UNUSED &&
          priv->config->din_pin == priv->config->dout_pin)
        {
          esp_configgpio(priv->config->din_pin,
                         INPUT_FUNCTION_2 | OUTPUT_FUNCTION_2);
          esp_gpio_matrix_in(priv->config->din_pin,
                             i2s_periph_signal[port].data_in_sig, 0);
          esp_gpio_matrix_out(priv->config->din_pin,
                              i2s_periph_signal[port].data_out_sigs[0],
                              0, 0);
        }
      else
        {
          esp_configgpio(priv->config->din_pin, INPUT_FUNCTION_2);
          esp_gpio_matrix_in(priv->config->din_pin,
                             i2s_periph_signal[port].data_in_sig, 0);
        }
    }

  if (priv->config->role == I2S_ROLE_SLAVE)
    {
      /* For "tx + slave" mode, select TX signal index for ws and bck */

      if (priv->config->tx_en && !priv->config->rx_en)
        {
#if SOC_I2S_HW_VERSION_2
          PERIPH_RCC_ATOMIC()
            {
              i2s_ll_mclk_bind_to_tx_clk(priv->config->ctx->dev);
            }
#endif

          esp_gpiowrite(priv->config->ws_pin, 1);
          esp_configgpio(priv->config->ws_pin, INPUT_FUNCTION_2);
          esp_gpio_matrix_in(priv->config->ws_pin,
                             i2s_periph_signal[port].s_tx_ws_sig, 0);

          esp_gpiowrite(priv->config->bclk_pin, 1);
          esp_configgpio(priv->config->bclk_pin, INPUT_FUNCTION_2);
          esp_gpio_matrix_in(priv->config->bclk_pin,
                             i2s_periph_signal[port].s_tx_bck_sig, 0);
        }
      else
        {
          /* For "tx + rx + slave" or "rx + slave" mode, select RX signal
           * index for ws and bck.
           */

          esp_gpiowrite(priv->config->ws_pin, 1);
          esp_configgpio(priv->config->ws_pin, INPUT_FUNCTION_2);
          esp_gpio_matrix_in(priv->config->ws_pin,
                             i2s_periph_signal[port].s_rx_ws_sig, 0);

          esp_gpiowrite(priv->config->bclk_pin, 1);
          esp_configgpio(priv->config->bclk_pin, INPUT_FUNCTION_2);
          esp_gpio_matrix_in(priv->config->bclk_pin,
                             i2s_periph_signal[port].s_rx_bck_sig, 0);
        }
    }
  else
    {
      /* Considering master role for the I2S port */

      /* Set MCLK pin */

      if (priv->config->mclk_pin != I2S_GPIO_UNUSED)
        {
          i2sinfo("Configuring GPIO%" PRIu8 " to output master clock\n",
                  priv->config->mclk_pin);

          esp_gpiowrite(priv->config->mclk_pin, 1);
          esp_configgpio(priv->config->mclk_pin, OUTPUT_FUNCTION_2);
          esp_gpio_matrix_out(priv->config->mclk_pin,
                              i2s_periph_signal[port].mck_out_sig, 0, 0);
        }

      if (priv->config->rx_en && !priv->config->tx_en)
        {
          /* For "rx + master" mode, select RX signal index for ws and bck */

#if SOC_I2S_HW_VERSION_2
          PERIPH_RCC_ATOMIC()
            {
              i2s_ll_mclk_bind_to_rx_clk(priv->config->ctx->dev);
            }
#endif

          esp_gpiowrite(priv->config->ws_pin, 1);
          esp_configgpio(priv->config->ws_pin, OUTPUT_FUNCTION_2);
          esp_gpio_matrix_out(priv->config->ws_pin,
                              i2s_periph_signal[port].m_rx_ws_sig, 0, 0);

          esp_gpiowrite(priv->config->bclk_pin, 1);
          esp_configgpio(priv->config->bclk_pin, OUTPUT_FUNCTION_2);
          esp_gpio_matrix_out(priv->config->bclk_pin,
                              i2s_periph_signal[port].m_rx_bck_sig, 0, 0);
        }
      else
        {
          /* For "tx + rx + master" or "tx + master" mode, select TX signal
           * index for ws and bck.
           */

          esp_gpiowrite(priv->config->ws_pin, 1);
          esp_configgpio(priv->config->ws_pin, OUTPUT_FUNCTION_2);
          esp_gpio_matrix_out(priv->config->ws_pin,
                              i2s_periph_signal[port].m_tx_ws_sig, 0, 0);

          esp_gpiowrite(priv->config->bclk_pin, 1);
          esp_configgpio(priv->config->bclk_pin, OUTPUT_FUNCTION_2);
          esp_gpio_matrix_out(priv->config->bclk_pin,
                              i2s_periph_signal[port].m_tx_bck_sig, 0, 0);
        }
    }

  /* Share BCLK and WS if in full-duplex mode */

  i2s_ll_share_bck_ws(priv->config->ctx->dev,
                      priv->config->tx_en && priv->config->rx_en);

  priv->data_width = priv->config->data_width;
  priv->channels = priv->config->total_slot;

  /* Configure the TX module */

  if (priv->config->tx_en)
    {
      if (priv->channels == 1)
        {
          tx_slot_cfg.slot_mode = I2S_SLOT_MODE_MONO;
        }
      else
        {
          tx_slot_cfg.slot_mode = I2S_SLOT_MODE_STEREO;
        }

      tx_slot_cfg.data_bit_width = priv->config->data_width;
      tx_slot_cfg.slot_bit_width = I2S_SLOT_BIT_WIDTH_AUTO;

      if (priv->config->audio_std_mode <= I2S_TDM_PCM)
        {
          if (priv->config->audio_std_mode == I2S_TDM_PHILIPS)
            {
              I2S_TDM_PHILIPS_SLOT_DEFAULT_CONFIG(tx_slot_cfg.tdm,
                                                  priv->data_width,
                                                  I2S_TDM_AUTO_SLOT);
            }
          else if (priv->config->audio_std_mode == I2S_TDM_MSB)
            {
              I2S_TDM_MSB_SLOT_DEFAULT_CONFIG(tx_slot_cfg.tdm,
                                              priv->data_width,
                                              I2S_TDM_AUTO_SLOT);
            }
          else
            {
              I2S_TDM_PCM_SHORT_SLOT_DEFAULT_CONFIG(tx_slot_cfg.tdm,
                                                    priv->data_width,
                                                    I2S_TDM_AUTO_SLOT);
            }

          i2s_hal_tdm_set_tx_slot(priv->config->ctx,
                                  priv->config->role == I2S_ROLE_SLAVE,
                                  &tx_slot_cfg);

          i2s_ll_tx_enable_tdm(priv->config->ctx->dev);
        }
      else
        {
          i2s_ll_tx_enable_pdm(priv->config->ctx->dev, true);
          I2S_PDM_TX_SLOT_DEFAULT_CONFIG(tx_slot_cfg.pdm_tx);
          i2s_hal_pdm_set_tx_slot(priv->config->ctx,
                                  priv->config->role == I2S_ROLE_SLAVE,
                                  &tx_slot_cfg);
        }

