sc750/nuttx/arch/risc-v/src/esp32p4/espressif/esp_i2s.c
      /* The default value for the master clock frequency (MCLK frequency)
       * can be set from the sample rate multiplied by a fixed value, known
       * as MCLK multiplier. This multiplier, however, should be divisible
       * by the number of bytes from a sample, i.e, for 24 bits, the
       * multiplier should be divisible by 3. NOTE: the MCLK frequency can
       * be adjusted on runtime, so this value remains valid only if the
       * upper half does not implement the `i2s_setmclkfrequency` method.
       */

      if (priv->config->data_width == I2S_DATA_BIT_WIDTH_24BIT)
        {
          priv->mclk_multiple = I2S_MCLK_MULTIPLE_384;
        }
      else
        {
          priv->mclk_multiple = I2S_MCLK_MULTIPLE_256;
        }

      ret = i2s_setmclkfrequency((struct i2s_dev_s *)priv,
                                 (priv->config->rate * priv->mclk_multiple));
      if (ret <= 0)
        {
          i2serr("Failed to set MCLK frequency: %d\n", ret);
          return ret;
        }

      priv->rate = priv->config->rate;
      ret = i2s_set_clock(priv);
      if (ret != OK)
        {
          i2serr("Failed to set clock: %d\n", ret);
          return ret;
        }
    }

  /* Configure the RX module */

  if (priv->config->rx_en)
    {
      if (priv->channels == 1)
        {
          rx_slot_cfg.slot_mode = I2S_SLOT_MODE_MONO;
        }
      else
        {
          rx_slot_cfg.slot_mode = I2S_SLOT_MODE_STEREO;
        }

      rx_slot_cfg.data_bit_width = priv->config->data_width;
      rx_slot_cfg.slot_bit_width = I2S_SLOT_BIT_WIDTH_AUTO;

      if (priv->config->audio_std_mode <= I2S_TDM_PCM)
        {
          /* If the role is slave or master and tx is enabled, then the role
           * is slave
           */

          bool is_slave = priv->config->role == I2S_ROLE_SLAVE || \
                          (priv->config->role == I2S_ROLE_MASTER && \
                           priv->config->tx_en);

          if (priv->config->audio_std_mode == I2S_TDM_PHILIPS)
            {
              I2S_TDM_PHILIPS_SLOT_DEFAULT_CONFIG(rx_slot_cfg.tdm,
                                                  priv->data_width,
                                                  I2S_TDM_AUTO_SLOT);
            }
          else if (priv->config->audio_std_mode == I2S_TDM_MSB)
            {
              I2S_TDM_MSB_SLOT_DEFAULT_CONFIG(rx_slot_cfg.tdm,
                                              priv->data_width,
                                              I2S_TDM_AUTO_SLOT);
            }
          else
            {
              I2S_TDM_PCM_SHORT_SLOT_DEFAULT_CONFIG(tx_slot_cfg.tdm,
                                                    priv->data_width,
                                                    I2S_TDM_AUTO_SLOT);
            }

          i2s_hal_tdm_set_rx_slot(priv->config->ctx,
                                  is_slave,
                                  &rx_slot_cfg);

          i2s_ll_rx_enable_tdm(priv->config->ctx->dev);
        }
      else
        {
          i2serr("Due to the lack of `PDM to PCM` module, \
                  PDM RX is not available\n");
        }

      /* The default value for the master clock frequency (MCLK frequency)
       * can be set from the sample rate multiplied by a fixed value, known
       * as MCLK multiplier. This multiplier, however, should be divisible
       * by the number of bytes from a sample, i.e, for 24 bits, the
       * multiplier should be divisible by 3. NOTE: the MCLK frequency can
       * be adjusted on runtime, so this value remains valid only if the
       * upper half does not implement the `i2s_setmclkfrequency` method.
       */

      if (priv->config->data_width == I2S_DATA_BIT_WIDTH_24BIT)
        {
          priv->mclk_multiple = I2S_MCLK_MULTIPLE_384;
        }
      else
        {
          priv->mclk_multiple = I2S_MCLK_MULTIPLE_256;
        }

      ret = i2s_setmclkfrequency((struct i2s_dev_s *)priv,
                                 (priv->config->rate * priv->mclk_multiple));
      if (ret <= 0)
        {
          i2serr("Failed to set MCLK frequency: %d\n", ret);
          return ret;
        }

      priv->rate = priv->config->rate;
      ret = i2s_set_clock(priv);
      if (ret != OK)
        {
          i2serr("Failed to set clock: %d\n", ret);
          return ret;
        }
    }

  return OK;
}

/****************************************************************************
 * Name: i2s_set_get_apll_freq
 *
 * Description:
 *   Calculates and sets the Audio Phase-Locked Loop (APLL) frequency
 *   required for a given master clock (MCLK) frequency. This function
 *   determines the appropriate divider to generate the expected APLL
 *   frequency, sets the hardware APLL to this frequency, and returns
 *   the actual frequency set.
 *   It also handles error conditions such as exceeding the maximum APLL
 *   frequency or invalid arguments, and logs relevant information and
 *   warnings.
 *
 * Input Parameters:
 *   mclk_freq_hz - The desired master clock frequency in Hz.
 *
 * Returned Value:
 *   The actual APLL frequency set in Hz, or 0 on failure.
 *
 ****************************************************************************/

#if SOC_I2S_SUPPORTS_APLL
static uint32_t i2s_set_get_apll_freq(uint32_t mclk_freq_hz)
{
  int mclk_div = (int)((CLK_LL_APLL_MIN_HZ / mclk_freq_hz) + 1);
  esp_err_t ret = ESP_OK;
  uint32_t expt_freq;
  uint32_t real_freq;

  /* Calculate the expected APLL  */

  /* apll_freq = mclk * div
   * when div = 1, hardware will still divide 2
   * when div = 0, the final mclk will be unpredictable
   * So the div here should be at least 2
   */

  mclk_div = mclk_div < 2 ? 2 : mclk_div;
  expt_freq = mclk_freq_hz * mclk_div;
  if (expt_freq > CLK_LL_APLL_MAX_HZ)
    {
      i2serr("The required APLL frequency exceed its maximum value");
      goto errout;
    }

  real_freq = 0;
  ret = periph_rtc_apll_freq_set(expt_freq, &real_freq);

  if (ret == ESP_ERR_INVALID_ARG)
    {
      i2serr("set APLL freq failed due to invalid argument");
      goto errout;
    }

  if (ret == ESP_ERR_INVALID_STATE)
    {
      i2swarn("APLL is occupied already, it is working at %"PRIu32" Hz while"
              " the expected frequency is %"PRIu32" Hz",
              real_freq, expt_freq);
      i2swarn("Trying to work at %"PRIu32" Hz...", real_freq);
    }

  i2sinfo("APLL expected frequency is %"PRIu32" Hz, real frequency is "
          "%"PRIu32" Hz", expt_freq, real_freq);
  return real_freq;

errout:
  UNUSED(real_freq);
  UNUSED(ret);
  return 0;
}
#endif

/****************************************************************************
 * Name: i2s_get_source_clk_freq
 *
 * Description:
 *   Retrieve the frequency of the specified I2S clock source.
 *   If the clock source is APLL and supported, it returns the frequency
 *   calculated for the given master clock frequency. Otherwise, it queries
 *   the clock tree for the frequency of the specified source.
 *
 * Input Parameters:
 *   clk_src      - The I2S clock source to query.
 *   mclk_freq_hz - The desired master clock frequency in Hz (used for APLL).
 *
 * Returned Value:
 *   The frequency of the specified clock source in Hz.
 *
 ****************************************************************************/

static uint32_t i2s_get_source_clk_freq(i2s_clock_src_t clk_src,
                                        uint32_t mclk_freq_hz)
{
  uint32_t clk_freq = 0;

#if SOC_I2S_SUPPORTS_APLL
  if (clk_src == I2S_CLK_SRC_APLL)
    {
      return i2s_set_get_apll_freq(mclk_freq_hz);
    }
#endif

