sc750/nuttx/arch/risc-v/src/esp32p4/espressif/esp_i2s.c
#ifdef I2S_LL_DEFAULT_CLK_SRC
  if (clk_src == I2S_CLK_SRC_DEFAULT)
    {
      clk_src = I2S_LL_DEFAULT_CLK_SRC;
    }
#endif

  esp_clk_tree_src_get_freq_hz(clk_src,
                               ESP_CLK_TREE_SRC_FREQ_PRECISION_CACHED,
                               &clk_freq);
  return clk_freq;
}

/****************************************************************************
 * Name: i2s_check_mclkfrequency
 *
 * Description:
 *   Check if MCLK frequency is compatible with the current data width and
 *   bits/sample set. Master clock should be multiple of the sample rate and
 *   bclk at the same time.
 *
 * Input Parameters:
 *   priv - Initialized I2S device structure.
 *
 * Returned Value:
 *   Returns the current master clock or a negated errno value on failure.
 *
 ****************************************************************************/

static int32_t i2s_check_mclkfrequency(struct esp_i2s_s *priv)
{
  uint32_t mclk_freq;
  uint32_t mclk_multiple = priv->mclk_multiple;
  uint32_t bclk = priv->rate * priv->config->total_slot * priv->data_width;
  int i;

  /* If the master clock is divisible by both the sample rate and the bit
   * clock, everything is as expected and we can return the current master
   * clock frequency.
   */

  if (priv->mclk_freq % priv->rate == 0 && priv->mclk_freq % bclk == 0)
    {
      priv->mclk_multiple = priv->mclk_freq / priv->rate;
      return priv->mclk_freq;
    }

  /* Select the lowest multiplier for setting the master clock */

  for (mclk_multiple = I2S_MCLK_MULTIPLE_128;
       mclk_multiple <= I2S_MCLK_MULTIPLE_512;
       mclk_multiple += I2S_MCLK_MULTIPLE_128)
    {
      mclk_freq = priv->rate * mclk_multiple;
      if (mclk_freq % priv->rate == 0 && mclk_freq % bclk == 0)
        {
          priv->mclk_multiple = mclk_multiple;
          mclk_freq = i2s_setmclkfrequency((struct i2s_dev_s *)priv,
                                           mclk_freq);
          if (mclk_freq <= 0)
            {
              i2serr("Failed to set MCLK frequency: %"PRIu32"\n", mclk_freq);
              return -EINVAL;
            }

          return mclk_freq;
        }
    }

  return -EINVAL;
}

/****************************************************************************
 * Name: i2s_set_datawidth
 *
 * Description:
 *   Set the I2S TX/RX data width.
 *
 * Input Parameters:
 *   priv - Initialized I2S device structure.
 *
 * Returned Value:
 *   Returns the resulting data width
 *
 ****************************************************************************/

static uint32_t i2s_set_datawidth(struct esp_i2s_s *priv)
{
  int width;
  if (priv->config->tx_en)
    {
      i2s_ll_tx_set_sample_bit(priv->config->ctx->dev,
                               priv->data_width, priv->data_width);
      i2s_ll_tx_set_half_sample_bit(priv->config->ctx->dev,
                                    priv->data_width);

      if (priv->config->audio_std_mode != I2S_TDM_PCM)
        {
          width = priv->data_width;
        }
      else
        {
          width = 1;
        }

      i2s_ll_tx_set_ws_width(priv->config->ctx->dev, width);
    }

  if (priv->config->rx_en)
    {
      i2s_ll_rx_set_sample_bit(priv->config->ctx->dev,
                               priv->data_width, priv->data_width);
      i2s_ll_rx_set_half_sample_bit(priv->config->ctx->dev,
                                    priv->data_width);

      if (priv->config->audio_std_mode != I2S_TDM_PCM)
        {
          width = priv->data_width;
        }
      else
        {
          width = 1;
        }

      i2s_ll_rx_set_ws_width(priv->config->ctx->dev, width);
    }

  return priv->data_width;
}

/****************************************************************************
 * Name: i2s_set_clock
 *
 * Description:
 *   Set the I2S TX sample rate by adjusting I2S clock.
 *
 * Input Parameters:
 *   priv - Initialized I2S device structure.
 *
 * Returned Value:
 *   Returns OK on success, a negative error code on failure
 *
 ****************************************************************************/

static int i2s_set_clock(struct esp_i2s_s *priv)
{
  uint32_t bclk;
  uint32_t mclk;
  uint32_t sclk;
  uint32_t mclk_div;
  uint16_t bclk_div;

  sclk = i2s_get_source_clk_freq(priv->config->tx_clk_src, priv->mclk_freq);

  if (sclk <= 0)
    {
      i2serr("Invalid source clock frequency: %"PRIu32"\n", sclk);
      return -EINVAL;
    }

  /* fmclk = bck_div * fbclk = fsclk / (mclk_div + b / a)
   * mclk_div is the I2S clock divider's integral value
   * b is the fraction clock divider's numerator value
   * a is the fraction clock divider's denominator value
   */

  if (priv->config->role == I2S_ROLE_MASTER)
    {
      bclk = priv->rate * priv->config->total_slot * priv->data_width;
      mclk = priv->mclk_freq;
      bclk_div = mclk / bclk;
    }
  else
    {
      /* For slave mode, mclk >= bclk * 8, so fix bclk_div to 2 first */

      bclk_div = 8;
      bclk = priv->rate * priv->config->total_slot * priv->data_width;
      mclk = bclk * bclk_div;
    }

  /* Calculate the nearest integer value of the I2S clock divider */

  mclk_div = sclk / mclk;

  i2sinfo("Clock division info: [sclk]%" PRIu32 " Hz [mdiv] %ld "
          "[mclk] %" PRIu32 " Hz [bdiv] %d [bclk] %" PRIu32 " Hz\n",
          sclk, mclk_div, mclk, bclk_div, bclk);

  priv->config->clk_info->bclk = bclk;
  priv->config->clk_info->bclk_div = bclk_div;
  priv->config->clk_info->mclk = mclk;
  priv->config->clk_info->mclk_div = mclk_div;
  priv->config->clk_info->sclk = sclk;

  PERIPH_RCC_ATOMIC()
    {
      i2s_hal_set_tx_clock(priv->config->ctx,
                           priv->config->clk_info,
                           priv->config->tx_clk_src,
                           NULL);

      i2s_hal_set_rx_clock(priv->config->ctx,
                           priv->config->clk_info,
                           priv->config->rx_clk_src,
                           NULL);
    }

  return OK;
}

/****************************************************************************
 * Name: i2s_tx_channel_start
 *
 * Description:
 *   Start TX channel for the I2S port
 *
 * Input Parameters:
 *   priv - Initialized I2S device structure.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

