sc750/nuttx/arch/risc-v/src/esp32p4/espressif/esp_i2s.c
static void i2s_tx_channel_start(struct esp_i2s_s *priv)
{
  if (priv->config->tx_en)
    {
#ifdef CONFIG_PM
      esp_pm_lock_acquire(priv->config->pm_lock);
#endif

      /* Reset the TX channel */

      i2s_hal_tx_reset(priv->config->ctx);

      /* Reset TX FIFO */

      i2s_hal_tx_reset_fifo(priv->config->ctx);

      /* Set I2S_RX_UPDATE bit to update the configs.
       * This bit is automatically cleared.
       */

      i2s_hal_tx_start(priv->config->ctx);

      priv->tx_started = true;

      i2sinfo("Started TX channel of port %ld\n", priv->config->port);
    }
}

/****************************************************************************
 * Name: i2s_rx_channel_start
 *
 * Description:
 *   Start RX channel for the I2S port
 *
 * Input Parameters:
 *   priv - Initialized I2S device structure.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void i2s_rx_channel_start(struct esp_i2s_s *priv)
{
  if (priv->config->rx_en)
    {
#ifdef CONFIG_PM
      esp_pm_lock_acquire(priv->config->pm_lock);
#endif

      /* Reset the RX channel */

      i2s_hal_rx_reset(priv->config->ctx);

      /* Reset RX FIFO */

      i2s_hal_rx_reset_fifo(priv->config->ctx);

      priv->rx_started = true;

      i2sinfo("Started RX channel of port %ld\n", priv->config->port);
    }
}

/****************************************************************************
 * Name: i2s_tx_channel_stop
 *
 * Description:
 *   Stop TX channel for the I2S port
 *
 * Input Parameters:
 *   priv - Initialized I2S device structure.
 *
 * Returned Value:
 *   OK on success; a negated errno value on failure.
 *
 ****************************************************************************/

static int i2s_tx_channel_stop(struct esp_i2s_s *priv)
{
  if (priv->config->tx_en)
    {
      esp_err_t err;

      if (!priv->tx_started)
        {
          i2swarn("TX channel of port %ld was previously stopped\n",
                  priv->config->port);
          return OK;
        }

      /* Stop TX channel */

      i2s_hal_tx_stop(priv->config->ctx);

      /* Stop outlink */

      err = gdma_stop(priv->dma_channel_tx);
      if (err != ESP_OK)
        {
          i2serr("Failed to stop DMA channel: %d\n", err);
          return -EINVAL;
        }

      priv->tx_started = false;
#ifdef CONFIG_PM
      esp_pm_lock_release(priv->config->pm_lock);
#endif

      i2sinfo("Stopped TX channel of port %ld\n", priv->config->port);
    }

  return OK;
}

/****************************************************************************
 * Name: i2s_rx_channel_stop
 *
 * Description:
 *   Stop RX channel for the I2S port
 *
 * Input Parameters:
 *   priv - Initialized I2S device structure.
 *
 * Returned Value:
 *   OK on success; a negated errno value on failure.
 *
 ****************************************************************************/

static int i2s_rx_channel_stop(struct esp_i2s_s *priv)
{
  if (priv->config->rx_en)
    {
      esp_err_t err;

      if (!priv->rx_started)
        {
          i2swarn("RX channel of port %ld was previously stopped\n",
                  priv->config->port);
          return OK;
        }

      /* Stop RX channel */

      i2s_hal_rx_stop(priv->config->ctx);

      err = gdma_stop(priv->dma_channel_rx);
      if (err != ESP_OK)
        {
          i2serr("Failed to stop DMA channel: %d\n", err);
          return -EINVAL;
        }

      priv->rx_started = false;
#ifdef CONFIG_PM
      esp_pm_lock_release(priv->config->pm_lock);
#endif

      i2sinfo("Stopped RX channel of port %ld\n", priv->config->port);
    }

  return OK;
}

/****************************************************************************
 * Name: i2s_tx_interrupt
 *
 * Description:
 *   I2S TX DMA interrupt handler. This function is called when a DMA
 *   transmit event occurs. It checks if the current DMA descriptor is
 *   the last in the chain and, if so, schedules the next transfer.
 *
 * Input Parameters:
 *   dma_chan    - GDMA channel handle
 *   event_data  - Pointer to GDMA event data structure
 *   arg         - I2S controller private data
 *
 * Returned Value:
 *   Returns false. (No context switch required.)
 *
 ****************************************************************************/

static bool IRAM_ATTR i2s_tx_interrupt(gdma_channel_handle_t dma_chan,
                                       gdma_event_data_t *event_data,
                                       void *arg)
{
  struct esp_i2s_s *priv = (struct esp_i2s_s *)arg;
  lldesc_t *cur = NULL;

  if (event_data->flags.normal_eof)
    {
      cur = (lldesc_t *)(event_data->tx_eof_desc_addr);

      /* If the current descriptor is the last one, schedule the transfer */

      if (STAILQ_NEXT(cur, qe) == NULL)
        {
          i2s_tx_schedule(priv, cur);
        }
    }

  return false;
}

/****************************************************************************
 * Name: i2s_tx_error
 *
 * Description:
 *   I2S TX DMA error interrupt handler. This function is called when a
 *   transmit DMA error occurs. Currently, it triggers a system panic.
 *
 * Input Parameters:
 *   dma_chan    - GDMA channel handle
 *   event_data  - Pointer to GDMA event data structure
 *   arg         - I2S controller private data
 *
 * Returned Value:
 *   Returns false. (No context switch required.)
 *
 ****************************************************************************/

static bool IRAM_ATTR i2s_tx_error(gdma_channel_handle_t dma_chan,
                                   gdma_event_data_t *event_data,
                                   void *arg)
{
  /* Just panic for now */

  PANIC();
  return false;
}

/****************************************************************************
 * Name: i2s_rx_error
 *
 * Description:
 *   I2S RX DMA error interrupt handler. This function is called when a
 *   receive DMA error occurs. Currently, it triggers a system panic.
 *
 * Input Parameters:
 *   dma_chan    - GDMA channel handle
 *   event_data  - Pointer to GDMA event data structure
 *   arg         - I2S controller private data
 *
 * Returned Value:
 *   Returns false. (No context switch required.)
 *
 ****************************************************************************/

