sc750/nuttx/arch/risc-v/src/esp32p4/espressif/esp_i2s.c
static bool IRAM_ATTR i2s_rx_error(gdma_channel_handle_t dma_chan,
                                   gdma_event_data_t *event_data,
                                   void *arg)
{
  /* Just panic for now */

  PANIC();
  return false;
}

/****************************************************************************
 * Name: i2s_rx_interrupt
 *
 * Description:
 *   I2S RX DMA interrupt handler. This function is called when a DMA
 *   transfer completes or an RX event occurs. It processes the DMA
 *   descriptor, synchronizes the buffer if needed, and schedules the
 *   next RX operation or updates the EOF number for the next descriptor.
 *
 * Input Parameters:
 *   dma_chan    - GDMA channel handle
 *   event_data  - Pointer to GDMA event data structure
 *   arg         - I2S controller private data
 *
 * Returned Value:
 *   Returns false. (No context switch required.)
 *
 ****************************************************************************/

static bool IRAM_ATTR i2s_rx_interrupt(gdma_channel_handle_t dma_chan,
                                       gdma_event_data_t *event_data,
                                       void *arg)
{
  struct esp_i2s_s *priv = (struct esp_i2s_s *)arg;
  lldesc_t *cur = NULL;
#if SOC_CACHE_INTERNAL_MEM_VIA_L1CACHE
  int alignment = cache_hal_get_cache_line_size(CACHE_LL_LEVEL_INT_MEM,
                                                CACHE_TYPE_DATA);
#endif
  if (event_data->flags.normal_eof)
    {
      cur = (lldesc_t *)(event_data->rx_eof_desc_addr);

#if SOC_CACHE_INTERNAL_MEM_VIA_L1CACHE
      esp_cache_msync(cur,
                      ALIGN_UP(sizeof(lldesc_t), alignment),
                      ESP_CACHE_MSYNC_FLAG_DIR_M2C);
      esp_cache_msync((void *)cur->buf, cur->length,
                      ESP_CACHE_MSYNC_FLAG_DIR_M2C);
#endif

      /* If the current descriptor is the last one, schedule the transfer */

      if (STAILQ_NEXT(cur, qe) == NULL)
        {
          if (cur->eof == 1 && cur->owner == 0)
            {
              i2s_rx_schedule(priv, cur);
            }
        }
      else
        {
          i2s_ll_rx_set_eof_num(priv->config->ctx->dev,
                                STAILQ_NEXT(cur, qe)->size);
        }
    }

  return false;
}

/****************************************************************************
 * Name: i2s_getmclkfrequency
 *
 * Description:
 *   Get the current master clock frequency.
 *
 * Input Parameters:
 *   dev - Device-specific state data
 *
 * Returned Value:
 *   Returns the current master clock.
 *
 ****************************************************************************/

static int32_t i2s_getmclkfrequency(struct i2s_dev_s *dev)
{
  struct esp_i2s_s *priv = (struct esp_i2s_s *)dev;

  return priv->mclk_freq;
}

/****************************************************************************
 * Name: i2s_setmclkfrequency
 *
 * Description:
 *   Set the master clock frequency. Usually, the MCLK is a multiple of the
 *   sample rate. Most of the audio codecs require setting specific MCLK
 *   frequency according to the sample rate.
 *
 * Input Parameters:
 *   dev        - Device-specific state data
 *   frequency  - The I2S master clock's frequency
 *
 * Returned Value:
 *   Returns the resulting master clock or a negated errno value on failure.
 *
 ****************************************************************************/

static int32_t i2s_setmclkfrequency(struct i2s_dev_s *dev,
                                     uint32_t frequency)
{
  struct esp_i2s_s *priv = (struct esp_i2s_s *)dev;
  uint32_t source_clk_freq = 0;

  source_clk_freq = i2s_get_source_clk_freq(priv->config->tx_clk_src,
                                            frequency);

  /* Check if the master clock frequency is beyond the highest possible
   * value and return an error.
   */

  if (frequency >= (source_clk_freq / 2))
    {
      return -EINVAL;
    }

  priv->mclk_freq = frequency;

  return frequency;
}

/****************************************************************************
 * Name: i2s_txchannels
 *
 * Description:
 *   Set the I2S TX number of channels.
 *   If channels is 0, the current number of channels is returned.
 *
 * Input Parameters:
 *   dev      - Device-specific state data
 *   channels - The I2S numbers of channels
 *
 * Returned Value:
 *   Returns the number of TX channels
 *
 ****************************************************************************/

static int i2s_txchannels(struct i2s_dev_s *dev, uint8_t channels)
{
  struct esp_i2s_s *priv = (struct esp_i2s_s *)dev;
  uint32_t channels_mask;
  bool is_mono = true;

  if (priv->config->tx_en)
    {
      bool is_started = priv->tx_started;

      if (channels == 0)
        {
          return priv->channels;
        }

      if (channels != 1 && channels != 2)
        {
          return 0;
        }

      if (is_started)
        {
          i2s_tx_channel_stop(priv);
        }

      priv->channels = channels;

      /* Always consider two channels. For mono (1-channel), we set the
       * I2S_TX_TDM_CHAN1_EN to 0 and I2S_TX_CHAN_EQUAL to 1 to send out
       * the data of the previous channel.
       */

      /* I2S_TX_TDM_TOT_CHAN_NUM = channels - 1 */

      i2s_ll_tx_set_chan_num(priv->config->ctx->dev, 2);

      channels_mask = I2S_TX_TDM_CHAN0_EN;
      if (priv->channels > 1)
        {
          channels_mask |= I2S_TX_TDM_CHAN0_EN | I2S_TX_TDM_CHAN1_EN;
          is_mono = false;
        }

      i2s_ll_tx_enable_mono_mode(priv->config->ctx->dev,
                                 is_mono);

      i2s_ll_tx_set_active_chan_mask(priv->config->ctx->dev, channels_mask);

      /* Set I2S_TX_UPDATE bit to update the configs.
       * This bit is automatically cleared.
       */

      if (is_started)
        {
          i2s_tx_channel_start(priv);
        }

      return priv->channels;
    }

  return 0;
}

/****************************************************************************
 * Name: i2s_rxchannels
 *
 * Description:
 *   Set the I2S RX number of channels.
 *   If channels is 0, the current number of channels is returned.
 *
 * Input Parameters:
 *   dev      - Device-specific state data
 *   channels - The I2S numbers of channels
 *
 * Returned Value:
 *   Returns the number of RX channels
 *
 ****************************************************************************/

