sc750/nuttx/arch/risc-v/src/esp32p4/espressif/esp_i2s.c
static int i2s_rxchannels(struct i2s_dev_s *dev, uint8_t channels)
{
  struct esp_i2s_s *priv = (struct esp_i2s_s *)dev;

  if (priv->config->rx_en)
    {
      if (channels == 0)
        {
          return priv->channels;
        }

      if (channels != 1 && channels != 2)
        {
          return 0;
        }

      priv->channels = channels;
      return priv->channels;
    }

  return 0;
}

/****************************************************************************
 * Name: i2s_txsamplerate
 *
 * Description:
 *   Set the I2S TX sample rate.  NOTE:  This will have no effect if (1) the
 *   driver does not support an I2S transmitter or if (2) the sample rate is
 *   driven by the I2S frame clock.  This may also have unexpected side-
 *   effects of the TX sample is coupled with the RX sample rate.
 *   If rate is 0, the current sample rate is returned.
 *
 * Input Parameters:
 *   dev  - Device-specific state data
 *   rate - The I2S sample rate in samples (not bits) per second
 *
 * Returned Value:
 *   OK on success, ERROR on fail
 *
 ****************************************************************************/

static int32_t i2s_txsamplerate(struct i2s_dev_s *dev, uint32_t rate)
{
  struct esp_i2s_s *priv = (struct esp_i2s_s *)dev;

  if (priv->config->tx_en)
    {
      bool is_started = priv->tx_started;

      if (rate == 0)
        {
          return priv->rate;
        }

      if (is_started)
        {
          i2s_tx_channel_stop(priv);
        }

      priv->rate = rate;

      if (i2s_check_mclkfrequency(priv) < 0)
        {
          return 0;
        }

      if (i2s_set_clock(priv) != OK)
        {
          i2serr("Failed to set clock\n");
          return ERROR;
        }

      if (is_started)
        {
          i2s_tx_channel_start(priv);
        }

      return priv->rate;
    }

  return 0;
}

/****************************************************************************
 * Name: i2s_rxsamplerate
 *
 * Description:
 *   Set the I2S RX sample rate.
 *   If rate is 0, the current sample rate is returned.
 *
 * Input Parameters:
 *   dev  - Device-specific state data
 *   rate - The I2S sample rate in samples (not bits) per second
 *
 * Returned Value:
 *   Returns the resulting bitrate
 *
 ****************************************************************************/

static int32_t i2s_rxsamplerate(struct i2s_dev_s *dev, uint32_t rate)
{
  struct esp_i2s_s *priv = (struct esp_i2s_s *)dev;

  if (priv->config->rx_en)
    {
      bool is_started = priv->rx_started;

      if (rate == 0)
        {
          return priv->rate;
        }

      if (is_started)
        {
          i2s_rx_channel_stop(priv);
        }

      priv->rate = rate;

      if (i2s_check_mclkfrequency(priv) < 0)
        {
          return 0;
        }

      if (i2s_set_clock(priv) != OK)
        {
          i2serr("Failed to set clock\n");
          return ERROR;
        }

      if (is_started)
        {
          i2s_rx_channel_start(priv);
        }

      return priv->rate;
    }

  return 0;
}

/****************************************************************************
 * Name: i2s_txdatawidth
 *
 * Description:
 *   Set the I2S TX data width.  The TX bitrate is determined by
 *   sample_rate * data_width.
 *   If width is 0, the current data width is returned.
 *
 * Input Parameters:
 *   dev   - Device-specific state data
 *   width - The I2S data with in bits.
 *
 * Returned Value:
 *   Returns the resulting data width
 *
 ****************************************************************************/

static int32_t i2s_txdatawidth(struct i2s_dev_s *dev, int bits)
{
  struct esp_i2s_s *priv = (struct esp_i2s_s *)dev;

  if (priv->config->tx_en)
    {
      bool is_started = priv->tx_started;

      if (bits == 0)
        {
          return priv->data_width;
        }

      if (is_started)
        {
          i2s_tx_channel_stop(priv);
        }

      priv->data_width = bits;

      i2s_set_datawidth(priv);

      if (is_started)
        {
          i2s_tx_channel_start(priv);
        }

      return bits;
    }

  return 0;
}

/****************************************************************************
 * Name: i2s_rxdatawidth
 *
 * Description:
 *   Set the I2S RX data width.  The RX bitrate is determined by
 *   sample_rate * data_width.
 *   If width is 0, the current data width is returned.
 *
 * Input Parameters:
 *   dev   - Device-specific state data
 *   width - The I2S data with in bits.
 *
 * Returned Value:
 *   Returns the resulting data width
 *
 ****************************************************************************/

static int32_t i2s_rxdatawidth(struct i2s_dev_s *dev, int bits)
{
  struct esp_i2s_s *priv = (struct esp_i2s_s *)dev;

  if (priv->config->rx_en)
    {
      bool is_started = priv->rx_started;

      if (bits == 0)
        {
          return priv->data_width;
        }

      if (is_started)
        {
          i2s_rx_channel_stop(priv);
        }

      priv->data_width = bits;

      i2s_set_datawidth(priv);

      if (is_started)
        {
          i2s_rx_channel_start(priv);
        }

      return bits;
    }

  return 0;
}

/****************************************************************************
 * Name: i2s_send
 *
 * Description:
 *   Send a block of data on I2S.
 *
 * Input Parameters:
 *   dev      - Device-specific state data
 *   apb      - A pointer to the audio buffer from which to send data
 *   callback - A user provided callback function that will be called at
 *              the completion of the transfer.
 *   arg      - An opaque argument that will be provided to the callback
 *              when the transfer complete
 *   timeout  - The timeout value to use.  The transfer will be cancelled
 *              and an ETIMEDOUT error will be reported if this timeout
 *              elapsed without completion of the DMA transfer.  Units
 *              are system clock ticks.  Zero means no timeout.
 *
 * Returned Value:
 *   OK on success; a negated errno value on failure.
 *
 ****************************************************************************/

static int i2s_send(struct i2s_dev_s *dev, struct ap_buffer_s *apb,
                    i2s_callback_t callback, void *arg, uint32_t timeout)
{
  struct esp_i2s_s *priv = (struct esp_i2s_s *)dev;

