sc750/nuttx/arch/risc-v/src/esp32p4/espressif/esp_i2s.c
      case AUDIOIOC_ALLOCBUFFER:
        {
          i2sinfo("AUDIOIOC_ALLOCBUFFER\n");

          bufdesc = (struct audio_buf_desc_s *) arg;
          ret = apb_alloc(bufdesc);
        }
        break;

      /* AUDIOIOC_FREEBUFFER - Free an audio buffer
       *
       *   ioctl argument:  pointer to an audio_buf_desc_s structure
       */

      case AUDIOIOC_FREEBUFFER:
        {
          i2sinfo("AUDIOIOC_FREEBUFFER\n");

          bufdesc = (struct audio_buf_desc_s *) arg;
          DEBUGASSERT(bufdesc->u.buffer != NULL);
          apb_free(bufdesc->u.buffer);
          ret = sizeof(struct audio_buf_desc_s);
        }
        break;

      default:
        break;
    }

  return ret;
}

/****************************************************************************
 * Name: i2s_dma_setup
 *
 * Description:
 *   Configure the DMA for the I2S peripheral
 *
 * Input Parameters:
 *   priv - Partially initialized I2S device structure. This function
 *          will complete the I2S specific portions of the initialization
 *          regarding the DMA operation.
 *
 * Returned Value:
 *   OK on success; A negated errno value on failure.
 *
 ****************************************************************************/

static int i2s_dma_setup(struct esp_i2s_s *priv)
{
  int ret = OK;
  esp_err_t err;
  gdma_trigger_t trig =
    {
      0
    };

  switch (priv->config->port)
    {
#if SOC_I2S_NUM > 2
      case I2S_NUM_2:
        trig = GDMA_MAKE_TRIGGER(GDMA_TRIG_PERIPH_I2S, 2);
        break;
#endif

#if SOC_I2S_NUM > 1
      case I2S_NUM_1:
      trig = GDMA_MAKE_TRIGGER(GDMA_TRIG_PERIPH_I2S, 1);
      break;
#endif

      case I2S_NUM_0:
      trig = GDMA_MAKE_TRIGGER(GDMA_TRIG_PERIPH_I2S, 0);
      break;

      default:
        i2serr("Unsupported I2S port number");
        return ESP_ERR_NOT_SUPPORTED;
    }

  /* Set up to receive GDMA interrupts on the current CPU. Each TX/RX channel
   * will be assigned to a different CPU interrupt.
   */

  priv->cpu = this_cpu();

  if (priv->config->tx_en)
    {
      gdma_channel_alloc_config_t tx_handle =
        {
          0
        };

      err = gdma_new_ahb_channel(&tx_handle, &priv->dma_channel_tx, NULL);
      if (err != ESP_OK)
        {
          i2serr("Failed to register tx dma channel: %d\n", err);
          return -EINVAL;
        }

      err = gdma_connect(priv->dma_channel_tx, trig);
      if (err != ESP_OK)
        {
          i2serr("Failed to connect tx dma channel: %d\n", err);
          ret = -EINVAL;
          goto err1;
        }

      gdma_tx_event_callbacks_t cb_tx =
        {
          .on_trans_eof = i2s_tx_interrupt,
          .on_descr_err = i2s_tx_error,
        };

      /* Set callback function for GDMA, the interrupt is triggered by GDMA,
       * then the GDMA ISR will call the callback function.
       */

      err = gdma_register_tx_event_callbacks(priv->dma_channel_tx,
                                             &cb_tx, priv);
      if (err != ESP_OK)
        {
          i2serr("Failed to register tx callback: %d\n", err);
          ret = -EINVAL;
          goto err2;
        }
    }

  if (priv->config->rx_en)
    {
      gdma_channel_alloc_config_t rx_handle =
        {
          0
        };

      err = gdma_new_ahb_channel(&rx_handle, NULL, &priv->dma_channel_rx);
      if (err != ESP_OK)
        {
          i2serr("Failed to register rx dma channel: %d\n", err);
          return -EINVAL;
        }

      err = gdma_connect(priv->dma_channel_rx, trig);
      if (err != ESP_OK)
        {
          i2serr("Failed to connect rx dma channel: %d\n", err);
          ret = -EINVAL;
          goto err1;
        }

      gdma_rx_event_callbacks_t cb_rx =
        {
          .on_recv_eof = i2s_rx_interrupt,
          .on_descr_err = i2s_rx_error,
        };

      /* Set callback function for GDMA, the interrupt is triggered by GDMA,
       * then the GDMA ISR will call the callback function.
       */

      err = gdma_register_rx_event_callbacks(priv->dma_channel_rx,
                                             &cb_rx, priv);
      if (err != ESP_OK)
        {
          i2serr("Failed to register rx callback: %d\n", err);
          ret = -EINVAL;
          goto err2;
        }
    }

  return OK;

err2:
  if (priv->config->tx_en)
    {
      gdma_disconnect(priv->dma_channel_tx);
    }

  if (priv->config->rx_en)
    {
      gdma_disconnect(priv->dma_channel_rx);
    }

err1:
  if (priv->config->tx_en)
    {
      gdma_del_channel(priv->dma_channel_tx);
    }

  if (priv->config->rx_en)
    {
      gdma_del_channel(priv->dma_channel_rx);
    }

  return ret;
}

/****************************************************************************
 * Name: esp_i2sbus_initialize
 *
 * Description:
 *   Initialize the selected I2S port
 *
 * Input Parameters:
 *   port - Port number (for hardware that has multiple I2S interfaces)
 *
 * Returned Value:
 *   Valid I2S device structure reference on success; a NULL on failure
 *
 ****************************************************************************/

struct i2s_dev_s *esp_i2sbus_initialize(int port)
{
  int ret;
  struct esp_i2s_s *priv = NULL;
  irqstate_t flags;
#ifdef CONFIG_PM
  esp_pm_lock_type_t pm_type = ESP_PM_APB_FREQ_MAX;
#endif

  i2sinfo("port: %d\n", port);

  /* Statically allocated I2S' device structure */

  switch (port)
    {
#ifdef CONFIG_ESPRESSIF_I2S0
      case ESPRESSIF_I2S0:
        priv = &esp_i2s0_priv;
        break;
#endif
      default:
        return NULL;
    }

  /* Allocate buffer containers */

  ret = i2s_buf_initialize(priv);
  if (ret < 0)
    {
      return NULL;
    }

  flags = spin_lock_irqsave(&priv->slock);

#ifdef CONFIG_PM
#  if SOC_I2S_SUPPORTS_APLL && SOC_I2S_HW_VERSION_2
  if (priv.tx_clk_src == I2S_CLK_SRC_APLL &&
      priv.tx_clk_src == I2S_CLK_SRC_APLL)
    {
      pm_type = ESP_PM_NO_LIGHT_SLEEP;
    }
#  endif

  if (priv->config->pm_lock == NULL)
    {
      esp_pm_lock_handle_t pm_lock = priv->config->pm_lock;
      ret =  esp_pm_lock_create(pm_type,
                                0,
                                "i2s_driver",
                                &pm_lock);
      if (ret != OK)
        {
          i2serr("Failed to create I2S PM lock\n");
          goto err;
        }
    }
#endif

  ret = i2s_configure(priv);
  if (ret < 0)
    {
      goto err;
    }

  ret = i2s_dma_setup(priv);
  if (ret < 0)
    {
      goto err;
    }

  /* Start TX channel */

  if (priv->config->tx_en)
    {
      priv->tx_started = false;
    }

  /* Start RX channel */

  if (priv->config->rx_en)
    {
      priv->rx_started = false;
    }

  spin_unlock_irqrestore(&priv->slock, flags);

  /* Success exit */

  i2sinfo("I2S%ld was successfully initialized\n", priv->config->port);

  return &priv->dev;

  /* Failure exit */

err:
  spin_unlock_irqrestore(&priv->slock, flags);
  return NULL;
}
